<?php
// +----------------------------------------------------------------------
// | B2C商城系统
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 陈果 <yayuneko@163.com> 
// +----------------------------------------------------------------------
// | Date: 2017-12-19
// +----------------------------------------------------------------------

namespace app\admin\controller;

/**
 * 后台首页控制器
 */
class Main extends Base
{   
    /**
     * 首页
     */
    public function index()
    {
        return $this->fetch();
    }

    /**
     * ajax请求修改密码页面
     */
    public function pwdAjax()
    {
    	return $this->fetch('Admin/modifyPwd'); 
    }
}
