<?php
// +----------------------------------------------------------------------
// | B2C商城系统
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 王怀礼 <576106898@qq.com>
// +----------------------------------------------------------------------
// | Date: 2017-12-15
// +----------------------------------------------------------------------

namespace app\admin\controller;

use think\Controller;
use think\Cache;

/**
 * 后台系统控制器
 */
class System extends Base 
{
	/**
     * 清空系统缓存
     */
    public function cleanCache()
    {
    	//删除文件 清空缓存数据
		delFile(RUNTIME_PATH);
		Cache::clear();
        $this->success('清除缓存成功');
    }
}