<?php
// +----------------------------------------------------------------------
// | B2C商城系统
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 王怀礼 <576106898@qq.com>
// +----------------------------------------------------------------------
// | Date: 2018-1-11
// +----------------------------------------------------------------------

namespace app\common\model;

use app\common\model\Base;

/**
 * 订单备注模型
 */
class OrderAction extends Base
{
	// 设置数据表（不含前缀)
    protected $name = 'order_action';
    // 数据表主键 复合主键使用数组定义 不设置则自动获取
    protected $pk 	= 'action_id';

}