<?php
// +----------------------------------------------------------------------
// | B2C商城系统
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 陈果 <yayuneko@384441137.com>
// +----------------------------------------------------------------------
// | Date: 2018-1-9
// +----------------------------------------------------------------------

namespace app\common\model;

use app\common\model\Base;

/**
 * 商品规格项关联模型
 */
class specGoodsPrice extends Base
{
	// 设置数据表（不含前缀)
    protected $name = 'spec_goods_price';

    // 数据表主键 复合主键使用数组定义 不设置则自动获取
    protected $pk = 'id';

}