<?php
// +----------------------------------------------------------------------
// | B2C商城系统
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 陈果 <yayuneko@163.com>
// +----------------------------------------------------------------------
// | Date: 2017-12-23
// +----------------------------------------------------------------------

namespace app\common\model;

use app\common\model\Base;

/**
 * 系统模型
 */
class SystemMenu extends Base
{
    //设置数据表（不含前缀)
    protected $name = 'system_menu';
    // 数据表主键 复合主键使用数组定义 不设置则自动获取
    protected $pk = 'id';
}