<?php
// +----------------------------------------------------------------------
// | B2C商城系统
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: dorisnzy <dorisnzy@163.com>
// +----------------------------------------------------------------------
// | Date: 2017-12-19
// +----------------------------------------------------------------------

namespace app\common\model;

use app\common\model\Base;

/**
 * 会员模型
 */
class User extends Base
{
    //设置数据表（不含前缀)
    protected $name = 'users';
    // 数据表主键 复合主键使用数组定义 不设置则自动获取
    protected $pk = 'user_id';
}