<?php
return [

    // +----------------------------------------------------------------------
    // | 模板设置
    // +----------------------------------------------------------------------
    'template'               => [
        // 模板引擎类型 支持 php think 支持扩展
        'type'         => 'Think',
        // 标签库标签开始标记
        'taglib_begin' => '<',
        // 标签库标签结束标记
        'taglib_end'   => '>',
    ],

    // 系统后台分页
    'page' => [
        'type' => 'layui',
        'list_rows' => 15,
    ],

    // 系统权限分组
    'right_group' => [
        'system' => '系统设置',
        'content' => '内容管理',
        'goods' => '商品中心',
        'member' => '会员中心',
        'order' => '订单中心',
        'count' => '统计报表',
    ],
];